# Taps
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

# Binaries
brew 'ack' # grep-like source code search tool
brew 'awscli' # AWS command-line interface
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl' # Command-line tool for DigitalOcean
brew 'doxygen'
brew 'dnsmasq', restart_service: true
brew 'fd'
brew 'ffmpeg'
brew 'gh' # GitHub command-line tool
brew 'ghostscript'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'highlight'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu' # NCurses Disk Usage
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install most of the fonts
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# PDF
brew 'qpdf'
brew 'xpdf'

# Development
brew 'php', restart_service: true
brew 'php@7.4'
brew 'php@8.0'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql', restart_service: true
brew 'nginx', restart_service: true
brew 'node'
brew 'redis'
brew 'ruby'
brew 'yarn'

# Documentation
#brew 'sphinx-doc'

# Apps
#cask '1password'
#cask '1password-cli'
cask 'adobe-creative-cloud'
#cask 'aerial'
#cask 'airflow'
#cask 'alfred'
cask 'android-file-transfer'
cask 'authy'
cask 'balenaetcher'
cask 'beyond-compare'
#cask 'dashlane'
#cask 'dbngin'
cask 'devtoys'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
#cask 'fork'
cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'imageoptim'
#cask 'insomnia'
cask 'iterm2'
#cask 'maccy'
cask 'microsoft-office'
cask 'phpstorm'
cask 'postman'
#cask 'qsync-client'
#cask 'screenflow'
#cask 'skype'
cask 'slack'
#cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'supertuxkart'
#cask 'suspicious-package'
cask 'tableplus'
#cask 'the-unarchiver'
cask 'toggl-track'
cask 'tower'
cask 'transmission-remote-gui'
cask 'transmit'
#cask 'tunnelblick'
cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'
cask 'xquartz'
cask 'zoomus'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlprettypatch'
#cask 'qlstephen'
#cask 'quicklook-json'
#cask 'quicklook-csv'

# Fonts
cask 'font-camingocode'
cask 'font-ibm-plex'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-victor-mono'

# Mac App Store
mas 'Brother P-touch Editor', id: 1453365242
